article/tensorflow-startup-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-10-11 Fri 21:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>TensorFlow 安装笔记</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../readme.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">TensorFlow 安装笔记</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org4eab4a0">1. 源码编译安装</a>
<ul>
<li><a href="#orgfb813d0">1.1. 安装环境和准备文件</a></li>
<li><a href="#org06f8c65">1.2. 安装操作系统</a></li>
<li><a href="#org63dc25b">1.3. 更新系统的源</a></li>
<li><a href="#orgb04e5aa">1.4. 安装 Python 的环境</a></li>
<li><a href="#org6ba280a">1.5. 安装 CUDA 编译工具</a></li>
<li><a href="#org288fb29">1.6. 安装 cuDNN 和 NCCL</a></li>
<li><a href="#org422a0fd">1.7. 安装 Python 依赖包</a></li>
<li><a href="#orge13a0bd">1.8. 安装 bazel 编译工具</a></li>
<li><a href="#org5e06b61">1.9. 使用 TensorFlow 源码编译和安装</a></li>
</ul>
</li>
<li><a href="#orgaafa0e4">2. 使用 pip 安装</a>
<ul>
<li><a href="#org636f232">2.1. 可安装的包</a></li>
<li><a href="#org81369fc">2.2. 更新 TensorFlow 包</a></li>
</ul>
</li>
<li><a href="#orge78f5f3">3. 测试程序</a></li>
<li><a href="#org42ba92a">4. 参考链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4eab4a0" class="outline-2">
<h2 id="org4eab4a0"><span class="section-number-2">1</span> 源码编译安装</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgfb813d0" class="outline-3">
<h3 id="orgfb813d0"><span class="section-number-3">1.1</span> 安装环境和准备文件</h3>
<div class="outline-text-3" id="text-1-1">
<p>
安装环境为 Ubuntu 18.04 操作系统，通过编译安装 TensorFlow 1.12.0。准备文件如
下：
</p>
<ul class="org-ul">
<li><code>ubuntu-18.04.1-desktop-amd64.iso</code></li>
<li><code>cuda_10.0.130_410.48_linux.run</code></li>
<li><code>cudnn-10.0-linux-x64-v7.4.2.24.tgz</code></li>
<li><code>nccl_2.3.7-1+cuda10.0_x86_64.txz</code></li>
<li><code>bazel-0.18.0-installer-linux-x86_64.sh</code></li>
</ul>
</div>
</div>

<div id="outline-container-org06f8c65" class="outline-3">
<h3 id="org06f8c65"><span class="section-number-3">1.2</span> 安装操作系统</h3>
<div class="outline-text-3" id="text-1-2">
<p>
安装操作系统参考 <a href="intall-ubuntu-os.html">这篇</a>
</p>
</div>
</div>

<div id="outline-container-org63dc25b" class="outline-3">
<h3 id="org63dc25b"><span class="section-number-3">1.3</span> 更新系统的源</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get update
sudo apt-get upgrade
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb04e5aa" class="outline-3">
<h3 id="orgb04e5aa"><span class="section-number-3">1.4</span> 安装 Python 的环境</h3>
<div class="outline-text-3" id="text-1-4">
<p>
TensorFlow 12 依赖的 Python 环境是 Python 3.6，先安装 Python 的相关依赖
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt install -y python-dev python-pip python3-dev python3-pip
</pre>
</div>
</div>
</div>

<div id="outline-container-org6ba280a" class="outline-3">
<h3 id="org6ba280a"><span class="section-number-3">1.5</span> 安装 CUDA 编译工具</h3>
<div class="outline-text-3" id="text-1-5">
<p>
检验系统正确地识别到了 NVIDIA 显卡
</p>
<div class="org-src-container">
<pre class="src src-sh">lspci | grep -i nvidia
</pre>
</div>

<div class="org-src-container">
<pre class="src src-text">01:00.0 VGA compatible controller: NVIDIA Corporation Device 1cbb (rev a1)
01:00.1 Audio device: NVIDIA Corporation GP107GL High Definition Audio Controller (rev a1)
</pre>
</div>

<p>
查看系统和 gcc 的版本
</p>
<div class="org-src-container">
<pre class="src src-sh">uname -m &amp;&amp; cat /etc/*release
gcc --version
</pre>
</div>

<p>
安装编译过程中的依赖
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get install -y build-essential <span style="color: #2aa198;">\</span>
     cmake git unzip zip <span style="color: #2aa198;">\</span>
     python-dev python3-dev python-pip python3-pip
</pre>
</div>

<p>
安装内核的头文件依赖
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26597;&#30475;&#20869;&#26680;&#29256;&#26412;</span>
uname -r
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23433;&#35013;&#20869;&#26680;&#30340;&#22836;&#25991;&#20214;</span>
sudo apt-get install linux-headers-$(uname -r)
</pre>
</div>

<p>
参考 <a href="https://docs.nvidia.com/cuda/index.html">CUDA Documentation</a> 文档安装 CUDA 驱动，这里使用 run 文件来安装
</p>

<p>
首先禁用 Nouveau 驱动
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo touch /etc/modprobe.d/blacklist-nouveau.conf
sudo echo <span style="color: #2aa198;">'blacklist nouveau'</span> &gt; /etc/modprobe.d/blacklist-nouveau.conf
sudo echo <span style="color: #2aa198;">'options nouveau modeset=0'</span> &gt;&gt; /etc/modprobe.d/blacklist-nouveau.conf
</pre>
</div>
<p>
更新内核 initramfs
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo update-initramfs -u
</pre>
</div>

<p>
删除之前安装的 CUDA
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo apt-get purge nvidia*
sudo apt-get autoremove
sudo apt-get autoclean
sudo rm -rf /usr/local/cuda*
</pre>
</div>

<p>
通过 run 文件安装 CUDA 驱动
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo sh cuda_10.0.130_410.48_linux.run
</pre>
</div>

<p>
安装驱动后的操作
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'export PATH=/usr/local/cuda-10.0/bin${PATH:+:${PATH}}'</span> &gt;&gt; ~/.bashrc
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'export LD_LIBRARY_PATH=/usr/local/cuda-10.0/lib64${LD_LIBRARY_PATH:+:${LD_LIBRARY_PATH}}'</span> &gt;&gt; ~/.bashrc

<span style="color: #6c71c4;">source</span> ~/.bashrc
sudo ldconfig

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26597;&#30475; CUDA &#26159;&#21542;&#23433;&#35013;&#25104;&#21151;</span>
nvidia-smi
</pre>
</div>
</div>
</div>

<div id="outline-container-org288fb29" class="outline-3">
<h3 id="org288fb29"><span class="section-number-3">1.6</span> 安装 cuDNN 和 NCCL</h3>
<div class="outline-text-3" id="text-1-6">
<p>
安装 cuDNN
</p>
<div class="org-src-container">
<pre class="src src-sh">tar xvf cudnn-10.0-linux-x64-v7.4.2.24.tgz
</pre>
</div>
<div class="org-src-container">
<pre class="src src-text">cuda
&#9500;&#9472;&#9472; include
&#9474;   &#9492;&#9472;&#9472; cudnn.h
&#9500;&#9472;&#9472; lib64
&#9474;   &#9500;&#9472;&#9472; libcudnn.so -&gt; libcudnn.so.7
&#9474;   &#9500;&#9472;&#9472; libcudnn.so.7 -&gt; libcudnn.so.7.4.2
&#9474;   &#9500;&#9472;&#9472; libcudnn.so.7.4.2
&#9474;   &#9492;&#9472;&#9472; libcudnn_static.a
&#9492;&#9472;&#9472; NVIDIA_SLA_cuDNN_Support.txt
</pre>
</div>

<p>
复制文件到 CUDA 中
</p>
<div class="org-src-container">
<pre class="src src-sh">sudo cp -R cuda/include/* /usr/local/cuda-10.0/include
sudo cp -R cuda/lib64/* /usr/local/cuda-10.0/lib64
</pre>
</div>

<p>
安装 NCCL
</p>
<div class="org-src-container">
<pre class="src src-sh">tar xvf nccl_2.3.7-1+cuda10.0_x86_64.txz
</pre>
</div>
<div class="org-src-container">
<pre class="src src-text">nccl_2.3.7-1+cuda10.0_x86_64
&#9500;&#9472;&#9472; include
&#9474;   &#9492;&#9472;&#9472; nccl.h
&#9500;&#9472;&#9472; lib
&#9474;   &#9500;&#9472;&#9472; libnccl.so -&gt; libnccl.so.2
&#9474;   &#9500;&#9472;&#9472; libnccl.so.2 -&gt; libnccl.so.2.3.7
&#9474;   &#9500;&#9472;&#9472; libnccl.so.2.3.7
&#9474;   &#9492;&#9472;&#9472; libnccl_static.a
&#9492;&#9472;&#9472; LICENSE.txt
</pre>
</div>

<p>
复制文件到 CUDA 目录中
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #6c71c4;">cd</span> nccl_2.3.7-1+cuda10.0_x86_64
sudo cp -R include/* /usr/local/cuda-10.0/include
sudo cp -R lib/* /usr/local/cuda-10.0/lib64
</pre>
</div>
</div>
</div>

<div id="outline-container-org422a0fd" class="outline-3">
<h3 id="org422a0fd"><span class="section-number-3">1.7</span> 安装 Python 依赖包</h3>
<div class="outline-text-3" id="text-1-7">
<p>
最好启动一个 virtualenv
</p>
<div class="org-src-container">
<pre class="src src-sh">mkdir ~/.venv &amp;&amp; <span style="color: #6c71c4;">cd</span> ~/.venv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#23433;&#35013; virtualenv &#20381;&#36182;</span>
pip install virtualenv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#26032;&#24314;&#34394;&#25311;&#29615;&#22659;</span>
virtualenv tfenv --python=python3
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21478;&#22806;&#19968;&#31181;&#24314;&#34394;&#25311;&#29615;&#22659;&#30340;&#26041;&#24335;</span>
python3 -m virtualenv tfenv

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">&#21551;&#29992;&#34394;&#25311;&#29615;&#22659;</span>
<span style="color: #6c71c4;">source</span> ~/.venv/tfenv/bin/activate
</pre>
</div>

<p>
然后安装相关依赖包
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install pip six <span style="color: #6c71c4;">numpy</span>==1.15.4 wheel setuptools mock future&gt;=0.17.1
pip install <span style="color: #6c71c4;">keras_applications</span>==1.0.6 --no-deps
pip install <span style="color: #6c71c4;">keras_preprocessing</span>==1.0.5 --no-deps
</pre>
</div>
</div>
</div>

<div id="outline-container-orge13a0bd" class="outline-3">
<h3 id="orge13a0bd"><span class="section-number-3">1.8</span> 安装 bazel 编译工具</h3>
<div class="outline-text-3" id="text-1-8">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;">#  </span><span style="color: #586e75; font-style: italic;">bazel &#20381;&#36182;</span>
sudo apt-get install -y build-essential pkg-config zip g++ zlib1g-dev unzip

./bazel-0.18.0-installer-linux-x86_64.sh --user
<span style="color: #6c71c4;">echo</span> <span style="color: #2aa198;">'export PATH=${HOME}/bin:${PATH:+:${PATH}}'</span> &gt;&gt; ~/.bashrc
<span style="color: #6c71c4;">source</span> ~/.bashrc
sudo ldconfig
</pre>
</div>
</div>
</div>

<div id="outline-container-org5e06b61" class="outline-3">
<h3 id="org5e06b61"><span class="section-number-3">1.9</span> 使用 TensorFlow 源码编译和安装</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-sh">git clone https://github.com/tensorflow/tensorflow.git
git checkout r1.12
</pre>
</div>

<p>
配置编译系统
</p>
<div class="org-src-container">
<pre class="src src-text">./tensorflow-gpu$ ./configure
WARNING: Processed legacy workspace file /home/ub64/Code/github/tensorflow-gpu/tools/bazel.rc. This file will not be processed in the next release of Bazel. Please read https://github.com/bazelbuild/bazel/issues/6319 for further information, including how to upgrade.
WARNING: An illegal reflective access operation has occurred
WARNING: Illegal reflective access by com.google.protobuf.UnsafeUtil (file:/home/ub64/.cache/bazel/_bazel_ub64/install/f1e11885a5cc7ba9947679cffb18bf94/_embedded_binaries/A-server.jar) to field java.lang.String.value
WARNING: Please consider reporting this to the maintainers of com.google.protobuf.UnsafeUtil
WARNING: Use --illegal-access=warn to enable warnings of further illegal reflective access operations
WARNING: All illegal access operations will be denied in a future release
WARNING: --batch mode is deprecated. Please instead explicitly shut down your Bazel server using the command "bazel shutdown".
You have bazel 0.18.0 installed.
Please specify the location of python. [Default is /home/ub64/.venv/gpu/bin/python]:

Found possible Python library paths:
  /home/ub64/.venv/gpu/lib/python3.6/site-packages
  .
Please input the desired Python library path to use.  Default is [/home/ub64/.venv/gpu/lib/python3.6/site-packages]

Do you wish to build TensorFlow with Apache Ignite support? [Y/n]: Y
Apache Ignite support will be enabled for TensorFlow.

Do you wish to build TensorFlow with XLA JIT support? [Y/n]: Y
XLA JIT support will be enabled for TensorFlow.

Do you wish to build TensorFlow with OpenCL SYCL support? [y/N]: N
No OpenCL SYCL support will be enabled for TensorFlow.

Do you wish to build TensorFlow with ROCm support? [y/N]: N
No ROCm support will be enabled for TensorFlow.

Do you wish to build TensorFlow with CUDA support? [y/N]: y
CUDA support will be enabled for TensorFlow.

Please specify the CUDA SDK version you want to use. [Leave empty to default to CUDA 9.0]: 10.0


Please specify the location where CUDA 10.0 toolkit is installed. Refer to README.md for more details. [Default is /usr/local/cuda]: /usr/local/cuda-10.0


Please specify the cuDNN version you want to use. [Leave empty to default to cuDNN 7]: 7.4.2


Please specify the location where cuDNN 7 library is installed. Refer to README.md for more details. [Default is /usr/local/cuda-10.0]: /usr/local/cuda-10.0


Do you wish to build TensorFlow with TensorRT support? [y/N]: N
No TensorRT support will be enabled for TensorFlow.

Please specify the NCCL version you want to use. If NCCL 2.2 is not installed, then you can use version 1.3 that can be fetched automatically but it may have worse performance with multiple GPUs. [Default is 2.2]: 2.3.7


Please specify the location where NCCL 2 library is installed. Refer to README.md for more details. [Default is /usr/local/cuda-10.0]:/usr/local/cuda-10.0


NCCL found at /usr/local/cuda-10.0/lib64/libnccl.so.2
Assuming NCCL header path is /usr/local/cuda-10.0/lib64/../include/nccl.h
Please specify a list of comma-separated Cuda compute capabilities you want to build with.
You can find the compute capability of your device at: https://developer.nvidia.com/cuda-gpus.
Please note that each additional compute capability significantly increases your build time and binary size. [Default is: 6.1]: 6.1


Do you want to use clang as CUDA compiler? [y/N]: N
nvcc will be used as CUDA compiler.

Please specify which gcc should be used by nvcc as the host compiler. [Default is /usr/bin/gcc]: /usr/bin/gcc


Do you wish to build TensorFlow with MPI support? [y/N]: N
No MPI support will be enabled for TensorFlow.

Please specify optimization flags to use during compilation when bazel option "--config=opt" is specified [Default is -march=native]:


Would you like to interactively configure ./WORKSPACE for Android builds? [y/N]: N
Not configuring the WORKSPACE for Android builds.

Preconfigured Bazel build configs. You can use any of the below by adding "--config=&lt;&gt;" to your build command. See tools/bazel.rc for more details.
        --config=mkl            # Build with MKL support.
        --config=monolithic     # Config for mostly static monolithic build.
        --config=gdr            # Build with GDR support.
        --config=verbs          # Build with libverbs support.
        --config=ngraph         # Build with Intel nGraph support.
Configuration finished
(gpu) ub64@hpz2:~/Code/github/tensorflow-gpu$
</pre>
</div>

<p>
编译源代码
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">CPU only</span>
bazel build --config=opt //tensorflow/tools/pip_package:build_pip_package
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">GPU version with CUDA</span>
bazel build --config=opt --config=cuda //tensorflow/tools/pip_package:build_pip_package
</pre>
</div>

<p>
打 wheel 包并安装
</p>
<div class="org-src-container">
<pre class="src src-sh">./bazel-bin/tensorflow/tools/pip_package/build_pip_package tensorflow_pkg
pip install tensorflow_pkg/tensorflow-1.12.0-cp36-cp36m-linux_x86_64.whl
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgaafa0e4" class="outline-2">
<h2 id="orgaafa0e4"><span class="section-number-2">2</span> 使用 pip 安装</h2>
<div class="outline-text-2" id="text-2">
<p>
使用 Python 自带的安装包工具 pip 安装比较方便的。根据目前官网的上的文档，目前
Python3 已经更新到了 Python3.7，但是 TensorFlow 目前只支持到 Python3.6，所以在
安装 Python 时安装 Python3.6。另外，pip 的安装和设置请参考 <a href="./05.setup-pip-envs.html">here</a> 。
</p>
</div>

<div id="outline-container-org636f232" class="outline-3">
<h3 id="org636f232"><span class="section-number-3">2.1</span> 可安装的包</h3>
<div class="outline-text-3" id="text-2-1">
<p>
官网上给出以下可选安装包：
</p>
<ol class="org-ol">
<li>tensorflow: Current release for CPU-only (recommended for beginners)</li>
<li>tensorflow-gpu: Current release with GPU support (Ubuntu and Windows)</li>
<li>tf-nightly: Nightly build for CPU-only (unstable)</li>
<li>tf-nightly-gpu: Nightly build with GPU support (unstable, Ubuntu and Windows)</li>
</ol>

<p>
直接使用下面指令安装即可：
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install tensorflow
</pre>
</div>
</div>
</div>

<div id="outline-container-org81369fc" class="outline-3">
<h3 id="org81369fc"><span class="section-number-3">2.2</span> 更新 TensorFlow 包</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-sh">pip install --upgrade tensorflow
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge78f5f3" class="outline-2">
<h2 id="orge78f5f3"><span class="section-number-2">3</span> 测试程序</h2>
<div class="outline-text-2" id="text-3">
<p>
官网是给出的使用 keras 运行 mnist 测试样例。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">mnist.py</span>
<span style="color: #859900;">import</span> tensorflow <span style="color: #859900;">as</span> tf
<span style="color: #6c71c4;">mnist</span> = tf.keras.datasets.mnist

<span style="color: #8d5649;">(</span>x_train, y_train<span style="color: #8d5649;">)</span>,<span style="color: #8d5649;">(</span>x_test, y_test<span style="color: #8d5649;">)</span> = mnist.load_data<span style="color: #8d5649;">()</span>
<span style="color: #6c71c4;">x_train</span>, <span style="color: #6c71c4;">x_test</span> = x_train / 255.0, x_test / 255.0

<span style="color: #6c71c4;">model</span> = tf.keras.models.Sequential<span style="color: #8d5649;">(</span><span style="color: #d8241f;">[</span>
  tf.keras.layers.Flatten<span style="color: #9564bf;">()</span>,
  tf.keras.layers.Dense<span style="color: #9564bf;">(</span>512, activation=tf.nn.relu<span style="color: #9564bf;">)</span>,
  tf.keras.layers.Dropout<span style="color: #9564bf;">(</span>0.2<span style="color: #9564bf;">)</span>,
  tf.keras.layers.Dense<span style="color: #9564bf;">(</span>10, activation=tf.nn.softmax<span style="color: #9564bf;">)</span>
<span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
model.<span style="color: #6c71c4;">compile</span><span style="color: #8d5649;">(</span>optimizer=<span style="color: #2aa198;">'adam'</span>,
              loss=<span style="color: #2aa198;">'sparse_categorical_crossentropy'</span>,
              metrics=<span style="color: #d8241f;">[</span><span style="color: #2aa198;">'accuracy'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>

model.fit<span style="color: #8d5649;">(</span>x_train, y_train, epochs=5<span style="color: #8d5649;">)</span>
model.evaluate<span style="color: #8d5649;">(</span>x_test, y_test<span style="color: #8d5649;">)</span>
</pre>
</div>

<p>
运行上述文件
</p>
<div class="org-src-container">
<pre class="src src-sh">python mnist.py
</pre>
</div>
</div>
</div>

<div id="outline-container-org42ba92a" class="outline-2">
<h2 id="org42ba92a"><span class="section-number-2">4</span> 参考链接</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://tensorflow.google.cn">Tensorflow zh-site</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Last Updated 2019-10-11 Fri 21:28. Created by Jinghui Hu at 2018-10-12 Fri 11:04.</p>
</div>
</body>
</html>
